In [1]:
import pandas as pd

In [2]:
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
df_people = pd.DataFrame(people)

In [4]:
df_people

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [5]:
df_people['full_name'] = df_people['first'] + ' ' + df_people['last']

In [6]:
df_people

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [7]:
df_people.drop(columns=['first', 'last'], inplace=True)

In [8]:
df_people

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [9]:
df_people['full_name'].str.split(' ')

0    [Corey, Schafer]
1         [Jane, Doe]
2         [John, Doe]
Name: full_name, dtype: object

In [10]:
df_people['full_name'].str.split(' ', expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [11]:
df_people[['first', 'last']] = df_people['full_name'].str.split(' ', expand=True)

In [12]:
df_people

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [13]:
# adding single row

df_people.append({'first': 'Steve', 'last': 'Harvey'}, ignore_index=True)

C:\Users\91940\AppData\Local\Temp\ipykernel_18528\2355412668.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_people.append({'first': 'Steve', 'last': 'Harvey'}, ignore_index=True)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3                      NaN            NaN  Steve   Harvey

In [14]:
# Append DataFrame

marvel = {
    "first": ['Tony', 'Steve'], 
    "last": ['Stark', 'Rogers'], 
    "email": ['IronMan@gmail.com', 'CaptionAmerica@gmail.com']
}

In [15]:
df_marvel = pd.DataFrame(marvel)

In [16]:
df_marvel

   first    last                     email
0   Tony   Stark         IronMan@gmail.com
1  Steve  Rogers  CaptionAmerica@gmail.com

In [17]:
df_people.append(df_marvel, ignore_index=True)

C:\Users\91940\AppData\Local\Temp\ipykernel_18528\1204160541.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_people.append(df_marvel, ignore_index=True)

                      email      full_name  first     last
0   CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1         JaneDoe@email.com       Jane Doe   Jane      Doe
2         JohnDoe@email.com       John Doe   John      Doe
3         IronMan@gmail.com            NaN   Tony    Stark
4  CaptionAmerica@gmail.com            NaN  Steve   Rogers

In [18]:
df_people

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

In [19]:
df_people = df_people.append(df_marvel, ignore_index=True)

C:\Users\91940\AppData\Local\Temp\ipykernel_18528\3078993809.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_people = df_people.append(df_marvel, ignore_index=True)

In [20]:
df_people

                      email      full_name  first     last
0   CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1         JaneDoe@email.com       Jane Doe   Jane      Doe
2         JohnDoe@email.com       John Doe   John      Doe
3         IronMan@gmail.com            NaN   Tony    Stark
4  CaptionAmerica@gmail.com            NaN  Steve   Rogers

In [21]:
# droping row

df_people.drop(index=4)

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe
3        IronMan@gmail.com            NaN   Tony    Stark

In [23]:
df_people[df_people['last'] == 'Doe']

               email full_name first last
1  JaneDoe@email.com  Jane Doe  Jane  Doe
2  JohnDoe@email.com  John Doe  John  Doe

In [24]:
df_people[df_people['last'] == 'Doe'].index

Int64Index([1, 2], dtype='int64')

In [25]:
df_people.drop(index=df_people[df_people['last'] == 'Doe'].index)

                      email      full_name  first     last
0   CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3         IronMan@gmail.com            NaN   Tony    Stark
4  CaptionAmerica@gmail.com            NaN  Steve   Rogers

In [26]:
df_people

                      email      full_name  first     last
0   CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1         JaneDoe@email.com       Jane Doe   Jane      Doe
2         JohnDoe@email.com       John Doe   John      Doe
3         IronMan@gmail.com            NaN   Tony    Stark
4  CaptionAmerica@gmail.com            NaN  Steve   Rogers

In [27]:
filt = (df_people['last'] == 'Doe')

In [28]:
df_people.drop(index=df_people[filt].index)

                      email      full_name  first     last
0   CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
3         IronMan@gmail.com            NaN   Tony    Stark
4  CaptionAmerica@gmail.com            NaN  Steve   Rogers